docs/may25.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-26 Mon 16:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>May-25</title>
<meta name="author" content="selffins" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="custom.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">May-25</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4f64d7f">1. Todo List</a>
<ul>
<li><a href="#orgcf54225">1.1. <span class="done DONE">DONE</span> LJ + multiset</a></li>
<li><a href="#org9af3bd3">1.2. <span class="todo TODO">TODO</span> cut-elim review (paper)</a></li>
<li><a href="#orgcde0870">1.3. <span class="todo TODO">TODO</span> LJ cut-elim formalization (attempt)</a></li>
<li><a href="#org3bdca07">1.4. <span class="todo TODO">TODO</span> modal logic system rewrite</a></li>
<li><a href="#orgb8b5849">1.5. <span class="todo TODO">TODO</span> pientka paper</a></li>
</ul>
</li>
<li><a href="#org322870b">2. LJ + coq-ll Multiset</a>
<ul>
<li><a href="#orgf1bda52">2.1. Fornulas</a></li>
<li><a href="#org5523ea3">2.2. Inference rules</a></li>
<li><a href="#org3cccb88">2.3. My Version</a></li>
<li><a href="#orgba3cbad">2.4. Proof of a small derivation in my LJ</a></li>
<li><a href="#org8579e84">2.5. Proof of exchange in my LJ</a></li>
</ul>
</li>
</ul>
</div>
</div>
<hr />
<p>
<a href="index.html">Homepage</a>
</p>
<div id="outline-container-org4f64d7f" class="outline-2">
<h2 id="org4f64d7f"><span class="section-number-2">1.</span> Todo List</h2>
<div class="outline-text-2" id="text-1">
<p>
Here are the todos for Wednesday. These are exploratory.
</p>
</div>
<div id="outline-container-orgcf54225" class="outline-3">
<h3 id="orgcf54225"><span class="section-number-3">1.1.</span> <span class="done DONE">DONE</span> LJ + multiset</h3>
</div>
<div id="outline-container-org9af3bd3" class="outline-3">
<h3 id="org9af3bd3"><span class="section-number-3">1.2.</span> <span class="todo TODO">TODO</span> cut-elim review (paper)</h3>
</div>
<div id="outline-container-orgcde0870" class="outline-3">
<h3 id="orgcde0870"><span class="section-number-3">1.3.</span> <span class="todo TODO">TODO</span> LJ cut-elim formalization (attempt)</h3>
</div>
<div id="outline-container-org3bdca07" class="outline-3">
<h3 id="org3bdca07"><span class="section-number-3">1.4.</span> <span class="todo TODO">TODO</span> modal logic system rewrite</h3>
</div>
<div id="outline-container-orgb8b5849" class="outline-3">
<h3 id="orgb8b5849"><span class="section-number-3">1.5.</span> <span class="todo TODO">TODO</span> pientka paper</h3>
</div>
</div>
<div id="outline-container-org322870b" class="outline-2">
<h2 id="org322870b"><span class="section-number-2">2.</span> LJ + coq-ll Multiset</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>We look at the file <code>coq-ll/FOLL/LL/Examples/LJLL.v</code>, where they define <code>LJ</code> and provide encodings into <code>LL</code> and prove adequacy of encoding.</li>

<li>Here are some relevant code snippets.</li>
</ul>
</div>
<div id="outline-container-orgf1bda52" class="outline-3">
<h3 id="orgf1bda52"><span class="section-number-3">2.1.</span> Fornulas</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Inductive definition:</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #FF6188;">Inductive</span> <span style="color: #A9DC76;">LForm</span> :<span style="color: #78DCE8;">Set</span> :=
  | bot <span style="color: #727072;">(* </span><span style="color: #727072;">false</span><span style="color: #727072;"> *)</span>
  | atom : nat -&gt; LForm <span style="color: #727072;">(* </span><span style="color: #727072;">atomic propositions are named with a natural number</span><span style="color: #727072;"> *)</span>
  | conj : LForm -&gt; LForm -&gt; LForm <span style="color: #727072;">(* </span><span style="color: #727072;">conjunction</span><span style="color: #727072;"> *)</span>
  | disj : LForm -&gt; LForm -&gt; LForm <span style="color: #727072;">(* </span><span style="color: #727072;">disjunction</span><span style="color: #727072;"> *)</span>
  | impl : LForm -&gt; LForm -&gt; LForm <span style="color: #727072;">(* </span><span style="color: #727072;">intuitionistic implication</span><span style="color: #727072;"> *)</span>
  .
</pre>
</div>

<ul class="org-ul">
<li><p>
Two formulas are either equal to one another or not.
</p>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #FF6188;">Theorem</span> <span style="color: #A9DC76;">LForm_dec_eq</span> : <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">F G</span> : LForm, {F = G} + {F &lt;&gt; G}.
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org5523ea3" class="outline-3">
<h3 id="org5523ea3"><span class="section-number-3">2.2.</span> Inference rules</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #FF6188;">Reserved Notation</span> <span style="color: #FFD866;">" L ';' n '|-P-' F"</span> (<span style="color: #78DCE8;">at</span> level <span style="color: #AB9DF2; font-weight: bold;">80</span>).
  <span style="color: #FF6188;">Inductive</span> <span style="color: #A9DC76;">sq</span> : list LForm -&gt; nat -&gt; LForm -&gt; <span style="color: #78DCE8;">Prop</span> :=
  | init : <span style="color: #78DCE8;">forall</span> (<span style="color: #FCFCFA;">L L'</span> :list LForm) a, L =mul= atom a :: L' -&gt; L ; <span style="color: #AB9DF2; font-weight: bold;">0</span> |-P- atom a
  | botL : <span style="color: #78DCE8;">forall</span> (<span style="color: #FCFCFA;">L L'</span> :list LForm) G , L =mul= bot :: L' -&gt; L ; <span style="color: #AB9DF2; font-weight: bold;">0</span> |-P- G
  | cR : <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">L F G n m</span> , L ; n |-P- F -&gt; L ; m |-P- G -&gt; L ; S (max n m) |-P- conj F G
  | cL : <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">L G G' F L' n</span>, L =mul= (conj G G') :: L' -&gt; G :: G' :: L' ; n |-P- F -&gt; L ; S n |-P- F
  | dR1 : <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">L F G n</span>, L ;  n |-P- F -&gt; L ; S n |-P- disj F G
  | dR2 : <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">L F G n</span>, L ;  n |-P- G -&gt; L ; S n |-P- disj F G
  | dL : <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">L L' F G H n m</span>, L =mul= disj F G :: L' -&gt;  F :: L' ;  n |-P- H -&gt; G :: L' ;  m |-P- H  -&gt; L ;  S (max n m) |-P- H
  | impR : <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">L F G n</span> , F :: L ; n |-P- G -&gt;  L ; S n |-P- impl F G
  | impL : <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">L L' F G H n m</span>,  L =mul= impl F G :: L' -&gt; L ; n |-P- F -&gt; G :: L' ; m |-P- H -&gt; L ; S (max n m)|-P- H
  <span style="color: #78DCE8;">where</span> <span style="color: #FFD866;">"L ; n |-P- F"</span> := (sq L n F).
</pre>
</div>

<ul class="org-ul">
<li>There is a lot to say. Notice how they include <code>n</code> as as part of the nation, which is the height of the tree. This is for an inductive measure in some metatheorem proof.</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #FF6188;">Reserved Notation</span> <span style="color: #FFD866;">" L ';' n '|-P-' F"</span> (<span style="color: #78DCE8;">at</span> level <span style="color: #AB9DF2; font-weight: bold;">80</span>). L =mul= (atom a :: L').
</pre>
</div>
<p>
We will remove this.
</p>

<dl class="org-dl">
<dt>Why isn&rsquo;t <code>impR</code> something like = L eq<sub>mul</sub> F</dt><dd><p>
L&rsquo; |-P- G= instead?
</p>
<div class="org-src-container">
<pre class="src src-coq">  | impR : <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">L F G n</span> , F :: L ; n |-P- G -&gt;  L ; S n |-P- impl F G
</pre>
</div></dd>
</dl>
</div>
</div>
<div id="outline-container-org3cccb88" class="outline-3">
<h3 id="org3cccb88"><span class="section-number-3">2.3.</span> My Version</h3>
<div class="outline-text-3" id="text-2-3">
<dl class="org-dl">
<dt>I&rsquo;m not too sure about the formatting here. It helps you read it better, because having to use =G mul<sub>eq</sub> A</dt><dd>G&rsquo;= makes it hard to read (compare my other LJ, which uses <code>G ++ [A] |- C</code> directly..). It doesn&rsquo;t matter anywhere else in the code.</dd>
</dl>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #FF6188;">Reserved Notation</span> <span style="color: #FFD866;">" G '|-' C "</span> (<span style="color: #78DCE8;">at</span> level <span style="color: #AB9DF2; font-weight: bold;">80</span>).
<span style="color: #FF6188;">Inductive</span> <span style="color: #A9DC76;">rules</span> : list LForm -&gt; LForm -&gt; <span style="color: #78DCE8;">Prop</span> :=
  | rules_init     : <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">G_atom_A G A</span>,
                            (G_atom_A =mul= atom A :: G)
                          -&gt; G_atom_A |- atom A             <span style="color: #727072;">(* </span><span style="color: #727072;">G, atom a |- atom a</span><span style="color: #727072;"> *)</span>
  | rules_bot_l    : <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">G_bot G C</span>,
                            (G_bot =mul= bot :: G)
                          -&gt; G_bot |- C                      <span style="color: #727072;">(* </span><span style="color: #727072;">G, bot |- C</span><span style="color: #727072;"> *)</span>
  | rules_conj_r   : <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">G A B</span>, G |- A -&gt; G |- B -&gt; G |- conj A B
  | rules_conj_l   : <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">G_conj_A_B A B C G</span>,
                            (G_conj_A_B =mul= (conj A B) :: G)
                         -&gt; A :: B :: G |- C
                         -&gt; G_conj_A_B |- C                 <span style="color: #727072;">(* </span><span style="color: #727072;">G, A, B |- C -&gt; G, conj A B |- C</span><span style="color: #727072;"> *)</span>
  | rules_disj_r_1 : <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">G A B</span>, G |- A -&gt; G |- disj A B
  | rules_disj_r_2 : <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">G A B</span>, G |- B -&gt; G |- disj A B
  | rules_disj_l   : <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">G_disj_A_B G A B C</span>,
                            (G_disj_A_B =mul= disj A B :: G)
                         -&gt; A :: G |- C
                         -&gt; B :: G |- C
                         -&gt; G_disj_A_B |- C                 <span style="color: #727072;">(* </span><span style="color: #727072;">G, A |- C -&gt; G, B |-  C -&gt; G, disj A B |- C</span><span style="color: #727072;"> *)</span>
  | rules_impl_r   : <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">G A B</span>, A :: G |- B -&gt; G |- impl A B
  | rules_impl_l   : <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">G_impl_l G A B C</span>,
                            (G_impl_l =mul= impl A B :: G)
                         -&gt; G_impl_l |- A
                         -&gt; B :: G |- C
                         -&gt; G_impl_l |- C
<span style="color: #78DCE8;">where</span> <span style="color: #FFD866;">" G '|-' C "</span> := (rules G C).
</pre>
</div>
</div>
</div>
<div id="outline-container-orgba3cbad" class="outline-3">
<h3 id="orgba3cbad"><span class="section-number-3">2.4.</span> Proof of a small derivation in my LJ</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #FF6188;">Example</span> <span style="color: #A9DC76;">Ex1_my_ver</span>: [(atom <span style="color: #AB9DF2; font-weight: bold;">3</span>)] |- impl (conj (atom <span style="color: #AB9DF2; font-weight: bold;">1</span>) (atom <span style="color: #AB9DF2; font-weight: bold;">2</span>)) (conj (atom <span style="color: #AB9DF2; font-weight: bold;">2</span>) (conj (atom <span style="color: #AB9DF2; font-weight: bold;">3</span>) (atom <span style="color: #AB9DF2; font-weight: bold;">1</span>))).
  <span style="text-decoration: underline;">remember</span> (atom <span style="color: #AB9DF2; font-weight: bold;">1</span>) <span style="color: #78DCE8;">as</span> A.
  <span style="text-decoration: underline;">remember</span> (atom <span style="color: #AB9DF2; font-weight: bold;">2</span>) <span style="color: #78DCE8;">as</span> B.
  <span style="text-decoration: underline;">remember</span> (atom <span style="color: #AB9DF2; font-weight: bold;">3</span>) <span style="color: #78DCE8;">as</span> C.
  <span style="text-decoration: underline;">eapply</span> rules_impl_r;<span style="text-decoration: underline;">eauto</span>.                   <span style="color: #727072;">(* </span><span style="color: #727072;">[C] |- impl (conj A B) (conj B (conj C A))</span><span style="color: #727072;"> *)</span>
  <span style="text-decoration: underline;">eapply</span> rules_conj_l;<span style="text-decoration: underline;">eauto</span>.                   <span style="color: #727072;">(* </span><span style="color: #727072;">[conj A B; C] |- conj B (conj C A)</span><span style="color: #727072;"> *)</span>
  <span style="text-decoration: underline;">eapply</span> rules_conj_r;<span style="text-decoration: underline;">eauto</span>.                   <span style="color: #727072;">(* </span><span style="color: #727072;">[A; B; C] |- conj B (conj C A)</span><span style="color: #727072;"> *)</span>
  <span style="text-decoration: underline;">rewrite</span> HeqB;<span style="text-decoration: underline;">eapply</span> rules_init;<span style="text-decoration: underline;">eauto</span>.        <span style="color: #727072;">(* </span><span style="color: #727072;">[A; B; C] |- B</span><span style="color: #727072;"> *)</span>
  <span style="text-decoration: underline;">eapply</span> rules_conj_r;<span style="text-decoration: underline;">eauto</span>.                   <span style="color: #727072;">(* </span><span style="color: #727072;">[A; B; C] |- conj C A</span><span style="color: #727072;"> *)</span>
  <span style="text-decoration: underline;">rewrite</span> HeqC;<span style="text-decoration: underline;">eapply</span> rules_init;<span style="text-decoration: underline;">eauto</span>.        <span style="color: #727072;">(* </span><span style="color: #727072;">[A; B; C] |- C</span><span style="color: #727072;"> *)</span>
  <span style="text-decoration: underline;">rewrite</span> HeqA;<span style="text-decoration: underline;">eapply</span> rules_init;<span style="text-decoration: underline;">eauto</span>.        <span style="color: #727072;">(* </span><span style="color: #727072;">[A; B; C] |- A</span><span style="color: #727072;"> *)</span>
  <span style="color: #FF6188;">Qed</span>.
</pre>
</div>
</div>
</div>
<div id="outline-container-org8579e84" class="outline-3">
<h3 id="org8579e84"><span class="section-number-3">2.5.</span> Proof of exchange in my LJ</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>Here is a slightly more involved proof. It is my first try at proving a metatheorem by induction on the proof tree. It wasn&rsquo;t too bad (but then again I had the coq-ll version for reference).</li>
<li>I learned the usefulness of tacticals like <code>;</code> and solvers like <code>auto</code>, and a new tactic <code>eapply</code>.</li>
<li>The original proof for the coq-ll LJ proceeds by strong induction on the size of the proof tree. Here, we induct on the proof tree instead.</li>
<li>Some cases were identical, and other cases were similar but not immediate.</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #727072;">(* </span><span style="color: #727072;">two contexts equivalent modulo exchange are</span><span style="color: #727072;"> *)</span>
<span style="color: #FF6188;">Theorem</span> <span style="color: #A9DC76;">Exch_my_ver</span> : <span style="color: #78DCE8;">forall</span> <span style="color: #FCFCFA;">G D C</span>, G =mul= D -&gt; G |- C -&gt; D |- C.
    <span style="text-decoration: underline;">intros</span>.
    <span style="text-decoration: underline;">generalize dependent</span> D.

    <span style="text-decoration: underline;">induction</span> H0;<span style="text-decoration: underline;">intros</span>;<span style="text-decoration: underline;">subst</span>.

    <span style="color: #727072;">(* </span><span style="color: #727072;">base case 1: init</span><span style="color: #727072;"> *)</span>
    <span style="color: #FCFCFA; font-weight: bold; text-decoration: underline;">-</span>
    <span style="text-decoration: underline;">rewrite</span> H <span style="color: #78DCE8;">in</span> H0.
    <span style="text-decoration: underline;">eapply</span> rules_init;<span style="text-decoration: underline;">auto</span>.

    <span style="color: #727072;">(* </span><span style="color: #727072;">base case 2: bot left</span><span style="color: #727072;"> *)</span>
    <span style="color: #FCFCFA; font-weight: bold; text-decoration: underline;">-</span>  <span style="text-decoration: underline;">rewrite</span> H <span style="color: #78DCE8;">in</span> H0.
    <span style="text-decoration: underline;">eapply</span> rules_bot_l;<span style="text-decoration: underline;">auto</span>.

    <span style="color: #727072;">(* </span><span style="color: #727072;">conjunction right</span><span style="color: #727072;"> *)</span>
    <span style="color: #727072;">(* </span><span style="color: #727072;">two IH: for D |- A and D |- B</span><span style="color: #727072;"> *)</span>
    <span style="color: #FCFCFA; font-weight: bold; text-decoration: underline;">-</span>  <span style="text-decoration: underline;">apply</span> rules_conj_r.
    <span style="color: #FCFCFA; font-weight: bold; text-decoration: underline;">--</span> <span style="text-decoration: underline;">apply</span> IHrules1. <span style="text-decoration: underline;">apply</span> H. <span style="color: #727072;">(* </span><span style="color: #727072;">IH: G =mul D+ -&gt; D |- A</span><span style="color: #727072;">*)</span>
    <span style="color: #FCFCFA; font-weight: bold; text-decoration: underline;">--</span> <span style="text-decoration: underline;">apply</span> IHrules2. <span style="text-decoration: underline;">apply</span> H.

    <span style="color: #727072;">(* </span><span style="color: #727072;">conjunction left</span><span style="color: #727072;"> *)</span>
    <span style="color: #FCFCFA; font-weight: bold; text-decoration: underline;">-</span> <span style="text-decoration: underline;">eapply</span> rules_conj_l.
      <span style="color: #FCFCFA; font-weight: bold; text-decoration: underline;">--</span> <span style="text-decoration: underline;">rewrite</span> &lt;- H1. <span style="text-decoration: underline;">apply</span> H.
      <span style="color: #FCFCFA; font-weight: bold; text-decoration: underline;">--</span> <span style="text-decoration: underline;">apply</span> H0.

    <span style="color: #727072;">(* </span><span style="color: #727072;">disjunction right 1</span><span style="color: #727072;"> *)</span>
    <span style="color: #FCFCFA; font-weight: bold; text-decoration: underline;">-</span> <span style="text-decoration: underline;">apply</span> rules_disj_r_1;<span style="text-decoration: underline;">auto</span>.

    <span style="color: #727072;">(* </span><span style="color: #727072;">disjunction right 2</span><span style="color: #727072;"> *)</span>
    <span style="color: #FCFCFA; font-weight: bold; text-decoration: underline;">-</span> <span style="text-decoration: underline;">apply</span> rules_disj_r_2;<span style="text-decoration: underline;">auto</span>.

    <span style="color: #727072;">(* </span><span style="color: #727072;">disjunction left</span><span style="color: #727072;"> *)</span>
    <span style="color: #FCFCFA; font-weight: bold; text-decoration: underline;">-</span> <span style="text-decoration: underline;">eapply</span> rules_disj_l.
      <span style="color: #FCFCFA; font-weight: bold; text-decoration: underline;">--</span> <span style="text-decoration: underline;">rewrite</span> &lt;- H0. <span style="text-decoration: underline;">apply</span> H.
      <span style="color: #FCFCFA; font-weight: bold; text-decoration: underline;">--</span> <span style="text-decoration: underline;">apply</span> H0_.
      <span style="color: #FCFCFA; font-weight: bold; text-decoration: underline;">--</span> <span style="text-decoration: underline;">apply</span> H0_0.

    <span style="color: #727072;">(* </span><span style="color: #727072;">implication right</span><span style="color: #727072;"> *)</span>
    <span style="color: #FCFCFA; font-weight: bold; text-decoration: underline;">-</span> <span style="text-decoration: underline;">apply</span> rules_impl_r. <span style="text-decoration: underline;">apply</span> IHrules;<span style="text-decoration: underline;">auto</span>.
    <span style="color: #727072;">(* </span><span style="color: #727072;">implication left</span><span style="color: #727072;"> *)</span>
    <span style="color: #FCFCFA; font-weight: bold; text-decoration: underline;">-</span> <span style="text-decoration: underline;">eapply</span> rules_impl_l.
      <span style="color: #FCFCFA; font-weight: bold; text-decoration: underline;">--</span> <span style="text-decoration: underline;">rewrite</span> &lt;- H0. <span style="text-decoration: underline;">apply</span> H.
      <span style="color: #FCFCFA; font-weight: bold; text-decoration: underline;">--</span> <span style="text-decoration: underline;">apply</span> IHrules1. <span style="text-decoration: underline;">apply</span> H0.
      <span style="color: #FCFCFA; font-weight: bold; text-decoration: underline;">--</span> <span style="text-decoration: underline;">apply</span> H0_0.
  <span style="color: #FF6188;">Qed</span>.
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: selffins</p>
<p class="date">Created: 2025-05-26 Mon 16:55</p>
</div>
</body>
</html>
